LEXICON_RU: dict[str, str] = {
    '/start':f'<em><b>Добро пожаловать в Flux Traffic!</b></em>\n\nFlux Traffic - это команда, которая обучает как полных новичков, так и '
              f'уже опытных арбитражников, и является одной из лучших и быстрорастущих в своей сфере.\n\n\n<em><b>ЧТО ВЫ ПОЛУЧАЕТЕ СОТРУДНИЧАЯ С'
              f' НАМИ:</b></em>\n<code>1.Удобный интерфейс для работы\n2.Качественные мануалы\n3.Статистика в реальном времени\n'
              f'4.Заявка на выплаты в любое время\n5.Личная реферальная ссылка\n6.Поддержка 24/7</code>\n\n Ваш аккаунт ещё'
              f' не зарегестрирован',
    'profile_button':'👤Профиль',
    'manuals_button':'📘Мануалы',
    'referals_button':'‍🤝Рефералы',
    'traffic_button':'⚡Лить трафик',
    'help_button':'❓Помощь',
    'out1_button':'⬅Назад',
    'manuals':f'<b>☠МАНУАЛЫ</b>\n├<a href="https://telegra.ph/UBT-v-Telegram-ot-A-do-YA-01-25">'
              f'Убт от а до я</a>\n├<a href="https://telegra.ph/Kak-lit-trafik-na-bloker-01-25">Льем трафик на блокер</a>\n'
              f'├<a href="https://telegra.ph/Manual-GameSport-02-22">Мануал GameSport</a>\n'
              f'└<a href="https://telegra.ph/Kak-i-gde-iskat-referalov-02-17">Рефоводство</a>\n\n⚠️<b>ВАЖНОЕ</b>\n'
              f'├<a href="https://t.me/+DjouE7nNp901YWIy">'
              f'Документы на бизнес акк</a>\n├<a href="https://t.me/+dazQY_BQ0l0zOGIy">Материалы для крео</a>\n├'
              f'<a href="https://telegra.ph/Oshibka-Slishkom-mnogo-popytok-v-TT-02-22">Слишком много попыток...</a>'
              f'\n└<a href="https://telegra.ph/Poleznye-ssylki-02-25-3">Полезные ссылки</a>',
    'register':f'<b>💬ПРАВИЛА FLUX TRAFFIC💬\n\nЗапрещено:</b>\n\n'
                                  f'<code>🔸Распространение запрещённых материалов, 18+ GIF/Стикеров/Видео/Фото\n🔸Попрошайничество\n'
                                  f'🔸Реклама сторонних проектов или же услуг\n🔸Дезинформация о проекте\n🔸Спамить\n'
                                  f'🔸 Оскорблять национальность/высказывать свои полит взгляды\n'
                                  f'🔸Оскорблять любого из представителей администрации</code>\n\n'
                                  f'<b>Вы подтверждаете, что ознакомились и согласны с условиями и правилами нашего проекта?</b>',
    'support_help':'<b>Если у вас есть какие либо вопросы по поводу работы бота / арбитража трафика.</b>\n\n'
                   f'1)Поищите ответ в мануалах\n2)Спросите в чате\n3)Обратитесь в Тех.Поддержку',
    'restart':'<b>⚙Бот был перезапущен\n\nНаш канал: @FluxTraffic\nНаш чат: @FluxTrafficChat</b>',
    'traffic_directions':'<b>Выберите направление:</b>',
    'registration_successful':'<b>✅Вы успешно зарегистрировались!\n\nНаш канал: @FluxTraffic\n\nНаш чат: @FluxTrafficChat</b>\n\nДля перезапуска бота нажмите /start',
    'ask_offer_name': "<b>Введите название направления:</b>",
    'offer_name_exists': "<b>Направление с именем '{offer_name}' уже существует. Введите другое имя.</b>",
    'ask_manual_link': "<b>Введите ссылку на мануал для данного направления:</b>",
    'ask_price_per_person': "<b>Введите сумму оплаты за одного человека:</b>",
    'invalid_price': "<b>Неверный формат суммы. Пожалуйста, введите число.</b>",
    'offer_created': "<b>Направление {offer_name} успешно создано!</b>",
    'offer_creation_error': "<b>Ошибка при создании оффера {offer_name}. Попробуйте позже.</b>",
    'no_command':'❌<b>Данная комнада отключена для чатов и каналов</b>'
}